###################################################################

# Created by write_sdc on Thu Dec 22 16:52:16 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
create_clock [get_ports clk]  -period 0.6  -waveform {0 0.3}
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  0  [get_ports icnt_aw_intf.clk]
set_input_delay -clock clk  0  [get_ports icnt_aw_intf.rst_n]
set_input_delay -clock clk  0  [get_ports icnt_aw_intf.avalid]
set_input_delay -clock clk  0  [get_ports icnt_aw_intf.aready]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aid[3]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aid[2]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aid[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aid[0]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[31]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[30]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[29]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[28]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[27]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[26]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[25]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[24]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[23]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[22]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[21]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[20]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[19]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[18]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[17]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[16]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[15]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[14]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[13]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[12]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[11]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[10]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[9]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[8]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[7]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[6]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[5]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[4]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[3]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[2]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[0]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.alen[3]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.alen[2]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.alen[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.alen[0]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.asize[2]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.asize[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.asize[0]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aburst[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_aw_intf.aburst[0]}]
set_input_delay -clock clk  0  [get_ports icnt_w_intf.clk]
set_input_delay -clock clk  0  [get_ports icnt_w_intf.rst_n]
set_input_delay -clock clk  0  [get_ports icnt_w_intf.wvalid]
set_input_delay -clock clk  0  [get_ports icnt_w_intf.wready]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wid[3]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wid[2]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wid[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wid[0]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[63]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[62]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[61]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[60]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[59]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[58]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[57]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[56]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[55]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[54]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[53]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[52]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[51]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[50]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[49]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[48]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[47]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[46]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[45]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[44]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[43]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[42]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[41]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[40]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[39]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[38]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[37]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[36]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[35]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[34]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[33]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[32]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[31]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[30]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[29]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[28]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[27]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[26]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[25]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[24]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[23]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[22]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[21]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[20]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[19]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[18]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[17]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[16]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[15]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[14]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[13]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[12]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[11]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[10]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[9]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[8]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[7]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[6]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[5]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[4]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[3]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[2]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[0]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[7]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[6]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[5]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[4]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[3]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[2]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[0]}]
set_input_delay -clock clk  0  [get_ports icnt_w_intf.wlast]
set_input_delay -clock clk  0  [get_ports icnt_b_intf.clk]
set_input_delay -clock clk  0  [get_ports icnt_b_intf.rst_n]
set_input_delay -clock clk  0  [get_ports icnt_b_intf.bvalid]
set_input_delay -clock clk  0  [get_ports icnt_b_intf.bready]
set_input_delay -clock clk  0  [get_ports {icnt_b_intf.bid[3]}]
set_input_delay -clock clk  0  [get_ports {icnt_b_intf.bid[2]}]
set_input_delay -clock clk  0  [get_ports {icnt_b_intf.bid[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_b_intf.bid[0]}]
set_input_delay -clock clk  0  [get_ports {icnt_b_intf.bresp[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_b_intf.bresp[0]}]
set_input_delay -clock clk  0  [get_ports icnt_ar_intf.clk]
set_input_delay -clock clk  0  [get_ports icnt_ar_intf.rst_n]
set_input_delay -clock clk  0  [get_ports icnt_ar_intf.avalid]
set_input_delay -clock clk  0  [get_ports icnt_ar_intf.aready]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aid[3]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aid[2]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aid[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aid[0]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[31]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[30]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[29]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[28]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[27]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[26]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[25]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[24]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[23]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[22]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[21]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[20]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[19]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[18]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[17]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[16]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[15]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[14]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[13]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[12]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[11]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[10]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[9]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[8]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[7]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[6]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[5]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[4]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[3]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[2]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[0]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.alen[3]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.alen[2]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.alen[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.alen[0]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.asize[2]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.asize[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.asize[0]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aburst[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_ar_intf.aburst[0]}]
set_input_delay -clock clk  0  [get_ports icnt_r_intf.clk]
set_input_delay -clock clk  0  [get_ports icnt_r_intf.rst_n]
set_input_delay -clock clk  0  [get_ports icnt_r_intf.rvalid]
set_input_delay -clock clk  0  [get_ports icnt_r_intf.rready]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rid[3]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rid[2]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rid[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rid[0]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[63]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[62]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[61]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[60]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[59]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[58]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[57]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[56]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[55]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[54]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[53]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[52]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[51]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[50]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[49]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[48]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[47]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[46]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[45]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[44]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[43]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[42]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[41]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[40]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[39]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[38]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[37]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[36]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[35]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[34]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[33]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[32]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[31]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[30]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[29]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[28]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[27]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[26]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[25]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[24]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[23]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[22]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[21]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[20]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[19]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[18]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[17]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[16]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[15]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[14]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[13]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[12]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[11]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[10]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[9]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[8]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[7]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[6]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[5]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[4]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[3]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[2]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[0]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rresp[1]}]
set_input_delay -clock clk  0  [get_ports {icnt_r_intf.rresp[0]}]
set_input_delay -clock clk  0  [get_ports icnt_r_intf.rlast]
set_input_delay -clock clk  0  [get_ports mc_aw_intf.clk]
set_input_delay -clock clk  0  [get_ports mc_aw_intf.rst_n]
set_input_delay -clock clk  0  [get_ports mc_aw_intf.avalid]
set_input_delay -clock clk  0  [get_ports mc_aw_intf.aready]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aid[3]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aid[2]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aid[1]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aid[0]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[31]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[30]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[29]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[28]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[27]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[26]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[25]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[24]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[23]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[22]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[21]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[20]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[19]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[18]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[17]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[16]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[15]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[14]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[13]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[12]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[11]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[10]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[9]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[8]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[7]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[6]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[5]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[4]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[3]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[2]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[1]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[0]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.alen[3]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.alen[2]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.alen[1]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.alen[0]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.asize[2]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.asize[1]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.asize[0]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aburst[1]}]
set_input_delay -clock clk  0  [get_ports {mc_aw_intf.aburst[0]}]
set_input_delay -clock clk  0  [get_ports mc_w_intf.clk]
set_input_delay -clock clk  0  [get_ports mc_w_intf.rst_n]
set_input_delay -clock clk  0  [get_ports mc_w_intf.wvalid]
set_input_delay -clock clk  0  [get_ports mc_w_intf.wready]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wid[3]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wid[2]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wid[1]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wid[0]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[63]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[62]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[61]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[60]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[59]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[58]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[57]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[56]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[55]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[54]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[53]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[52]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[51]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[50]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[49]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[48]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[47]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[46]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[45]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[44]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[43]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[42]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[41]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[40]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[39]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[38]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[37]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[36]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[35]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[34]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[33]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[32]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[31]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[30]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[29]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[28]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[27]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[26]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[25]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[24]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[23]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[22]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[21]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[20]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[19]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[18]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[17]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[16]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[15]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[14]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[13]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[12]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[11]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[10]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[9]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[8]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[7]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[6]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[5]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[4]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[3]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[2]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[1]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wdata[0]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[7]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[6]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[5]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[4]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[3]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[2]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[1]}]
set_input_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[0]}]
set_input_delay -clock clk  0  [get_ports mc_w_intf.wlast]
set_input_delay -clock clk  0  [get_ports mc_b_intf.clk]
set_input_delay -clock clk  0  [get_ports mc_b_intf.rst_n]
set_input_delay -clock clk  0  [get_ports mc_b_intf.bvalid]
set_input_delay -clock clk  0  [get_ports mc_b_intf.bready]
set_input_delay -clock clk  0  [get_ports {mc_b_intf.bid[3]}]
set_input_delay -clock clk  0  [get_ports {mc_b_intf.bid[2]}]
set_input_delay -clock clk  0  [get_ports {mc_b_intf.bid[1]}]
set_input_delay -clock clk  0  [get_ports {mc_b_intf.bid[0]}]
set_input_delay -clock clk  0  [get_ports {mc_b_intf.bresp[1]}]
set_input_delay -clock clk  0  [get_ports {mc_b_intf.bresp[0]}]
set_input_delay -clock clk  0  [get_ports mc_ar_intf.clk]
set_input_delay -clock clk  0  [get_ports mc_ar_intf.rst_n]
set_input_delay -clock clk  0  [get_ports mc_ar_intf.avalid]
set_input_delay -clock clk  0  [get_ports mc_ar_intf.aready]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aid[3]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aid[2]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aid[1]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aid[0]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[31]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[30]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[29]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[28]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[27]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[26]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[25]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[24]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[23]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[22]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[21]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[20]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[19]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[18]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[17]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[16]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[15]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[14]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[13]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[12]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[11]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[10]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[9]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[8]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[7]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[6]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[5]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[4]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[3]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[2]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[1]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[0]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.alen[3]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.alen[2]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.alen[1]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.alen[0]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.asize[2]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.asize[1]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.asize[0]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aburst[1]}]
set_input_delay -clock clk  0  [get_ports {mc_ar_intf.aburst[0]}]
set_input_delay -clock clk  0  [get_ports mc_r_intf.clk]
set_input_delay -clock clk  0  [get_ports mc_r_intf.rst_n]
set_input_delay -clock clk  0  [get_ports mc_r_intf.rvalid]
set_input_delay -clock clk  0  [get_ports mc_r_intf.rready]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rid[3]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rid[2]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rid[1]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rid[0]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[63]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[62]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[61]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[60]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[59]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[58]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[57]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[56]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[55]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[54]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[53]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[52]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[51]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[50]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[49]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[48]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[47]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[46]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[45]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[44]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[43]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[42]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[41]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[40]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[39]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[38]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[37]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[36]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[35]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[34]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[33]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[32]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[31]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[30]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[29]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[28]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[27]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[26]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[25]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[24]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[23]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[22]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[21]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[20]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[19]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[18]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[17]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[16]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[15]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[14]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[13]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[12]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[11]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[10]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[9]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[8]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[7]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[6]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[5]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[4]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[3]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[2]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[1]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rdata[0]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rresp[1]}]
set_input_delay -clock clk  0  [get_ports {mc_r_intf.rresp[0]}]
set_input_delay -clock clk  0  [get_ports mc_r_intf.rlast]
set_output_delay -clock clk  0  [get_ports icnt_aw_intf.avalid]
set_output_delay -clock clk  0  [get_ports icnt_aw_intf.aready]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aid[3]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aid[2]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aid[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aid[0]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[31]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[30]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[29]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[28]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[27]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[26]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[25]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[24]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[23]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[22]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[21]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[20]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[19]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[18]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[17]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[16]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[15]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[14]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[13]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[12]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[11]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[10]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[9]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[8]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[7]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[6]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[5]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[4]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[3]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[2]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aaddr[0]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.alen[3]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.alen[2]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.alen[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.alen[0]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.asize[2]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.asize[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.asize[0]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aburst[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_aw_intf.aburst[0]}]
set_output_delay -clock clk  0  [get_ports icnt_w_intf.wvalid]
set_output_delay -clock clk  0  [get_ports icnt_w_intf.wready]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wid[3]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wid[2]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wid[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wid[0]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[63]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[62]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[61]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[60]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[59]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[58]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[57]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[56]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[55]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[54]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[53]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[52]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[51]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[50]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[49]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[48]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[47]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[46]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[45]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[44]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[43]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[42]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[41]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[40]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[39]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[38]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[37]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[36]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[35]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[34]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[33]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[32]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[31]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[30]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[29]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[28]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[27]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[26]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[25]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[24]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[23]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[22]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[21]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[20]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[19]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[18]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[17]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[16]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[15]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[14]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[13]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[12]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[11]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[10]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[9]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[8]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[7]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[6]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[5]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[4]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[3]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[2]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wdata[0]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[7]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[6]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[5]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[4]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[3]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[2]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_w_intf.wstrb[0]}]
set_output_delay -clock clk  0  [get_ports icnt_w_intf.wlast]
set_output_delay -clock clk  0  [get_ports icnt_b_intf.bvalid]
set_output_delay -clock clk  0  [get_ports icnt_b_intf.bready]
set_output_delay -clock clk  0  [get_ports {icnt_b_intf.bid[3]}]
set_output_delay -clock clk  0  [get_ports {icnt_b_intf.bid[2]}]
set_output_delay -clock clk  0  [get_ports {icnt_b_intf.bid[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_b_intf.bid[0]}]
set_output_delay -clock clk  0  [get_ports {icnt_b_intf.bresp[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_b_intf.bresp[0]}]
set_output_delay -clock clk  0  [get_ports icnt_ar_intf.avalid]
set_output_delay -clock clk  0  [get_ports icnt_ar_intf.aready]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aid[3]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aid[2]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aid[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aid[0]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[31]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[30]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[29]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[28]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[27]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[26]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[25]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[24]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[23]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[22]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[21]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[20]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[19]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[18]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[17]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[16]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[15]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[14]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[13]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[12]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[11]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[10]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[9]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[8]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[7]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[6]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[5]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[4]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[3]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[2]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aaddr[0]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.alen[3]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.alen[2]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.alen[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.alen[0]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.asize[2]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.asize[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.asize[0]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aburst[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_ar_intf.aburst[0]}]
set_output_delay -clock clk  0  [get_ports icnt_r_intf.rvalid]
set_output_delay -clock clk  0  [get_ports icnt_r_intf.rready]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rid[3]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rid[2]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rid[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rid[0]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[63]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[62]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[61]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[60]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[59]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[58]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[57]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[56]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[55]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[54]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[53]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[52]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[51]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[50]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[49]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[48]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[47]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[46]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[45]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[44]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[43]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[42]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[41]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[40]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[39]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[38]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[37]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[36]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[35]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[34]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[33]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[32]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[31]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[30]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[29]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[28]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[27]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[26]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[25]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[24]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[23]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[22]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[21]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[20]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[19]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[18]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[17]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[16]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[15]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[14]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[13]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[12]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[11]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[10]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[9]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[8]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[7]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[6]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[5]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[4]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[3]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[2]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rdata[0]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rresp[1]}]
set_output_delay -clock clk  0  [get_ports {icnt_r_intf.rresp[0]}]
set_output_delay -clock clk  0  [get_ports icnt_r_intf.rlast]
set_output_delay -clock clk  0  [get_ports mc_aw_intf.avalid]
set_output_delay -clock clk  0  [get_ports mc_aw_intf.aready]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aid[3]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aid[2]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aid[1]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aid[0]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[31]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[30]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[29]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[28]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[27]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[26]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[25]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[24]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[23]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[22]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[21]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[20]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[19]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[18]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[17]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[16]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[15]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[14]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[13]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[12]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[11]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[10]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[9]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[8]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[7]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[6]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[5]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[4]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[3]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[2]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[1]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aaddr[0]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.alen[3]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.alen[2]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.alen[1]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.alen[0]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.asize[2]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.asize[1]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.asize[0]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aburst[1]}]
set_output_delay -clock clk  0  [get_ports {mc_aw_intf.aburst[0]}]
set_output_delay -clock clk  0  [get_ports mc_w_intf.wvalid]
set_output_delay -clock clk  0  [get_ports mc_w_intf.wready]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wid[3]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wid[2]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wid[1]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wid[0]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[63]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[62]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[61]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[60]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[59]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[58]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[57]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[56]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[55]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[54]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[53]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[52]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[51]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[50]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[49]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[48]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[47]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[46]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[45]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[44]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[43]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[42]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[41]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[40]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[39]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[38]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[37]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[36]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[35]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[34]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[33]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[32]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[31]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[30]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[29]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[28]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[27]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[26]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[25]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[24]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[23]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[22]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[21]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[20]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[19]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[18]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[17]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[16]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[15]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[14]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[13]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[12]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[11]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[10]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[9]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[8]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[7]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[6]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[5]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[4]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[3]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[2]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[1]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wdata[0]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[7]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[6]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[5]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[4]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[3]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[2]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[1]}]
set_output_delay -clock clk  0  [get_ports {mc_w_intf.wstrb[0]}]
set_output_delay -clock clk  0  [get_ports mc_w_intf.wlast]
set_output_delay -clock clk  0  [get_ports mc_b_intf.bvalid]
set_output_delay -clock clk  0  [get_ports mc_b_intf.bready]
set_output_delay -clock clk  0  [get_ports {mc_b_intf.bid[3]}]
set_output_delay -clock clk  0  [get_ports {mc_b_intf.bid[2]}]
set_output_delay -clock clk  0  [get_ports {mc_b_intf.bid[1]}]
set_output_delay -clock clk  0  [get_ports {mc_b_intf.bid[0]}]
set_output_delay -clock clk  0  [get_ports {mc_b_intf.bresp[1]}]
set_output_delay -clock clk  0  [get_ports {mc_b_intf.bresp[0]}]
set_output_delay -clock clk  0  [get_ports mc_ar_intf.avalid]
set_output_delay -clock clk  0  [get_ports mc_ar_intf.aready]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aid[3]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aid[2]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aid[1]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aid[0]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[31]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[30]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[29]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[28]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[27]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[26]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[25]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[24]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[23]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[22]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[21]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[20]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[19]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[18]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[17]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[16]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[15]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[14]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[13]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[12]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[11]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[10]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[9]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[8]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[7]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[6]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[5]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[4]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[3]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[2]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[1]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aaddr[0]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.alen[3]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.alen[2]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.alen[1]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.alen[0]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.asize[2]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.asize[1]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.asize[0]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aburst[1]}]
set_output_delay -clock clk  0  [get_ports {mc_ar_intf.aburst[0]}]
set_output_delay -clock clk  0  [get_ports mc_r_intf.rvalid]
set_output_delay -clock clk  0  [get_ports mc_r_intf.rready]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rid[3]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rid[2]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rid[1]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rid[0]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[63]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[62]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[61]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[60]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[59]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[58]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[57]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[56]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[55]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[54]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[53]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[52]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[51]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[50]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[49]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[48]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[47]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[46]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[45]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[44]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[43]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[42]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[41]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[40]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[39]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[38]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[37]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[36]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[35]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[34]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[33]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[32]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[31]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[30]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[29]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[28]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[27]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[26]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[25]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[24]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[23]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[22]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[21]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[20]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[19]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[18]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[17]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[16]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[15]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[14]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[13]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[12]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[11]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[10]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[9]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[8]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[7]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[6]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[5]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[4]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[3]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[2]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[1]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rdata[0]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rresp[1]}]
set_output_delay -clock clk  0  [get_ports {mc_r_intf.rresp[0]}]
set_output_delay -clock clk  0  [get_ports mc_r_intf.rlast]
set_input_transition -max 0.1  [get_ports clk]
set_input_transition -min 0.1  [get_ports clk]
set_input_transition -max 0.1  [get_ports rst_n]
set_input_transition -min 0.1  [get_ports rst_n]
set_input_transition -max 0.1  [get_ports icnt_aw_intf.clk]
set_input_transition -min 0.1  [get_ports icnt_aw_intf.clk]
set_input_transition -max 0.1  [get_ports icnt_aw_intf.rst_n]
set_input_transition -min 0.1  [get_ports icnt_aw_intf.rst_n]
set_input_transition -max 0.1  [get_ports icnt_aw_intf.avalid]
set_input_transition -min 0.1  [get_ports icnt_aw_intf.avalid]
set_input_transition -max 0.1  [get_ports icnt_aw_intf.aready]
set_input_transition -min 0.1  [get_ports icnt_aw_intf.aready]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aid[3]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aid[3]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aid[2]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aid[2]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aid[1]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aid[1]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aid[0]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aid[0]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[31]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[31]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[30]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[30]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[29]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[29]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[28]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[28]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[27]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[27]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[26]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[26]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[25]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[25]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[24]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[24]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[23]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[23]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[22]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[22]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[21]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[21]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[20]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[20]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[19]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[19]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[18]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[18]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[17]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[17]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[16]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[16]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[15]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[15]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[14]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[14]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[13]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[13]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[12]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[12]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[11]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[11]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[10]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[10]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[9]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[9]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[8]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[8]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[7]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[7]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[6]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[6]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[5]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[5]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[4]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[4]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[3]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[3]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[2]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[2]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[1]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[1]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aaddr[0]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aaddr[0]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.alen[3]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.alen[3]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.alen[2]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.alen[2]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.alen[1]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.alen[1]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.alen[0]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.alen[0]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.asize[2]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.asize[2]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.asize[1]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.asize[1]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.asize[0]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.asize[0]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aburst[1]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aburst[1]}]
set_input_transition -max 0.1  [get_ports {icnt_aw_intf.aburst[0]}]
set_input_transition -min 0.1  [get_ports {icnt_aw_intf.aburst[0]}]
set_input_transition -max 0.1  [get_ports icnt_w_intf.clk]
set_input_transition -min 0.1  [get_ports icnt_w_intf.clk]
set_input_transition -max 0.1  [get_ports icnt_w_intf.rst_n]
set_input_transition -min 0.1  [get_ports icnt_w_intf.rst_n]
set_input_transition -max 0.1  [get_ports icnt_w_intf.wvalid]
set_input_transition -min 0.1  [get_ports icnt_w_intf.wvalid]
set_input_transition -max 0.1  [get_ports icnt_w_intf.wready]
set_input_transition -min 0.1  [get_ports icnt_w_intf.wready]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wid[3]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wid[3]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wid[2]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wid[2]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wid[1]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wid[1]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wid[0]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wid[0]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[63]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[63]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[62]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[62]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[61]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[61]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[60]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[60]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[59]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[59]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[58]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[58]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[57]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[57]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[56]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[56]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[55]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[55]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[54]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[54]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[53]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[53]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[52]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[52]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[51]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[51]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[50]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[50]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[49]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[49]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[48]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[48]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[47]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[47]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[46]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[46]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[45]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[45]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[44]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[44]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[43]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[43]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[42]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[42]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[41]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[41]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[40]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[40]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[39]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[39]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[38]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[38]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[37]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[37]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[36]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[36]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[35]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[35]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[34]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[34]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[33]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[33]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[32]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[32]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[31]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[31]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[30]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[30]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[29]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[29]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[28]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[28]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[27]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[27]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[26]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[26]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[25]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[25]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[24]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[24]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[23]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[23]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[22]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[22]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[21]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[21]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[20]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[20]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[19]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[19]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[18]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[18]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[17]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[17]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[16]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[16]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[15]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[15]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[14]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[14]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[13]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[13]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[12]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[12]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[11]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[11]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[10]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[10]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[9]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[9]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[8]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[8]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[7]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[7]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[6]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[6]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[5]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[5]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[4]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[4]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[3]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[3]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[2]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[2]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[1]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[1]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wdata[0]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wdata[0]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wstrb[7]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wstrb[7]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wstrb[6]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wstrb[6]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wstrb[5]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wstrb[5]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wstrb[4]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wstrb[4]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wstrb[3]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wstrb[3]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wstrb[2]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wstrb[2]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wstrb[1]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wstrb[1]}]
set_input_transition -max 0.1  [get_ports {icnt_w_intf.wstrb[0]}]
set_input_transition -min 0.1  [get_ports {icnt_w_intf.wstrb[0]}]
set_input_transition -max 0.1  [get_ports icnt_w_intf.wlast]
set_input_transition -min 0.1  [get_ports icnt_w_intf.wlast]
set_input_transition -max 0.1  [get_ports icnt_b_intf.clk]
set_input_transition -min 0.1  [get_ports icnt_b_intf.clk]
set_input_transition -max 0.1  [get_ports icnt_b_intf.rst_n]
set_input_transition -min 0.1  [get_ports icnt_b_intf.rst_n]
set_input_transition -max 0.1  [get_ports icnt_b_intf.bvalid]
set_input_transition -min 0.1  [get_ports icnt_b_intf.bvalid]
set_input_transition -max 0.1  [get_ports icnt_b_intf.bready]
set_input_transition -min 0.1  [get_ports icnt_b_intf.bready]
set_input_transition -max 0.1  [get_ports {icnt_b_intf.bid[3]}]
set_input_transition -min 0.1  [get_ports {icnt_b_intf.bid[3]}]
set_input_transition -max 0.1  [get_ports {icnt_b_intf.bid[2]}]
set_input_transition -min 0.1  [get_ports {icnt_b_intf.bid[2]}]
set_input_transition -max 0.1  [get_ports {icnt_b_intf.bid[1]}]
set_input_transition -min 0.1  [get_ports {icnt_b_intf.bid[1]}]
set_input_transition -max 0.1  [get_ports {icnt_b_intf.bid[0]}]
set_input_transition -min 0.1  [get_ports {icnt_b_intf.bid[0]}]
set_input_transition -max 0.1  [get_ports {icnt_b_intf.bresp[1]}]
set_input_transition -min 0.1  [get_ports {icnt_b_intf.bresp[1]}]
set_input_transition -max 0.1  [get_ports {icnt_b_intf.bresp[0]}]
set_input_transition -min 0.1  [get_ports {icnt_b_intf.bresp[0]}]
set_input_transition -max 0.1  [get_ports icnt_ar_intf.clk]
set_input_transition -min 0.1  [get_ports icnt_ar_intf.clk]
set_input_transition -max 0.1  [get_ports icnt_ar_intf.rst_n]
set_input_transition -min 0.1  [get_ports icnt_ar_intf.rst_n]
set_input_transition -max 0.1  [get_ports icnt_ar_intf.avalid]
set_input_transition -min 0.1  [get_ports icnt_ar_intf.avalid]
set_input_transition -max 0.1  [get_ports icnt_ar_intf.aready]
set_input_transition -min 0.1  [get_ports icnt_ar_intf.aready]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aid[3]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aid[3]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aid[2]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aid[2]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aid[1]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aid[1]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aid[0]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aid[0]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[31]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[31]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[30]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[30]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[29]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[29]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[28]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[28]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[27]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[27]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[26]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[26]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[25]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[25]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[24]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[24]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[23]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[23]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[22]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[22]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[21]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[21]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[20]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[20]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[19]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[19]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[18]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[18]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[17]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[17]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[16]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[16]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[15]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[15]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[14]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[14]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[13]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[13]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[12]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[12]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[11]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[11]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[10]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[10]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[9]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[9]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[8]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[8]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[7]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[7]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[6]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[6]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[5]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[5]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[4]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[4]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[3]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[3]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[2]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[2]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[1]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[1]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aaddr[0]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aaddr[0]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.alen[3]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.alen[3]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.alen[2]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.alen[2]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.alen[1]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.alen[1]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.alen[0]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.alen[0]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.asize[2]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.asize[2]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.asize[1]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.asize[1]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.asize[0]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.asize[0]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aburst[1]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aburst[1]}]
set_input_transition -max 0.1  [get_ports {icnt_ar_intf.aburst[0]}]
set_input_transition -min 0.1  [get_ports {icnt_ar_intf.aburst[0]}]
set_input_transition -max 0.1  [get_ports icnt_r_intf.clk]
set_input_transition -min 0.1  [get_ports icnt_r_intf.clk]
set_input_transition -max 0.1  [get_ports icnt_r_intf.rst_n]
set_input_transition -min 0.1  [get_ports icnt_r_intf.rst_n]
set_input_transition -max 0.1  [get_ports icnt_r_intf.rvalid]
set_input_transition -min 0.1  [get_ports icnt_r_intf.rvalid]
set_input_transition -max 0.1  [get_ports icnt_r_intf.rready]
set_input_transition -min 0.1  [get_ports icnt_r_intf.rready]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rid[3]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rid[3]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rid[2]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rid[2]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rid[1]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rid[1]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rid[0]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rid[0]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[63]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[63]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[62]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[62]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[61]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[61]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[60]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[60]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[59]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[59]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[58]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[58]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[57]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[57]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[56]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[56]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[55]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[55]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[54]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[54]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[53]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[53]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[52]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[52]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[51]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[51]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[50]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[50]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[49]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[49]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[48]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[48]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[47]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[47]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[46]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[46]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[45]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[45]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[44]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[44]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[43]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[43]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[42]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[42]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[41]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[41]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[40]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[40]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[39]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[39]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[38]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[38]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[37]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[37]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[36]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[36]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[35]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[35]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[34]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[34]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[33]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[33]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[32]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[32]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[31]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[31]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[30]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[30]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[29]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[29]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[28]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[28]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[27]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[27]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[26]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[26]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[25]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[25]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[24]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[24]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[23]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[23]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[22]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[22]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[21]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[21]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[20]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[20]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[19]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[19]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[18]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[18]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[17]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[17]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[16]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[16]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[15]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[15]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[14]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[14]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[13]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[13]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[12]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[12]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[11]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[11]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[10]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[10]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[9]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[9]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[8]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[8]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[7]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[7]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[6]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[6]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[5]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[5]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[4]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[4]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[3]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[3]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[2]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[2]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[1]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[1]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rdata[0]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rdata[0]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rresp[1]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rresp[1]}]
set_input_transition -max 0.1  [get_ports {icnt_r_intf.rresp[0]}]
set_input_transition -min 0.1  [get_ports {icnt_r_intf.rresp[0]}]
set_input_transition -max 0.1  [get_ports icnt_r_intf.rlast]
set_input_transition -min 0.1  [get_ports icnt_r_intf.rlast]
set_input_transition -max 0.1  [get_ports mc_aw_intf.clk]
set_input_transition -min 0.1  [get_ports mc_aw_intf.clk]
set_input_transition -max 0.1  [get_ports mc_aw_intf.rst_n]
set_input_transition -min 0.1  [get_ports mc_aw_intf.rst_n]
set_input_transition -max 0.1  [get_ports mc_aw_intf.avalid]
set_input_transition -min 0.1  [get_ports mc_aw_intf.avalid]
set_input_transition -max 0.1  [get_ports mc_aw_intf.aready]
set_input_transition -min 0.1  [get_ports mc_aw_intf.aready]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aid[3]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aid[3]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aid[2]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aid[2]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aid[1]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aid[1]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aid[0]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aid[0]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[31]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[31]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[30]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[30]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[29]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[29]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[28]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[28]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[27]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[27]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[26]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[26]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[25]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[25]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[24]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[24]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[23]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[23]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[22]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[22]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[21]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[21]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[20]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[20]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[19]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[19]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[18]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[18]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[17]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[17]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[16]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[16]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[15]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[15]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[14]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[14]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[13]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[13]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[12]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[12]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[11]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[11]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[10]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[10]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[9]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[9]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[8]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[8]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[7]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[7]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[6]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[6]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[5]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[5]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[4]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[4]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[3]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[3]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[2]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[2]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[1]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[1]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aaddr[0]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aaddr[0]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.alen[3]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.alen[3]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.alen[2]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.alen[2]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.alen[1]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.alen[1]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.alen[0]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.alen[0]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.asize[2]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.asize[2]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.asize[1]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.asize[1]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.asize[0]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.asize[0]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aburst[1]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aburst[1]}]
set_input_transition -max 0.1  [get_ports {mc_aw_intf.aburst[0]}]
set_input_transition -min 0.1  [get_ports {mc_aw_intf.aburst[0]}]
set_input_transition -max 0.1  [get_ports mc_w_intf.clk]
set_input_transition -min 0.1  [get_ports mc_w_intf.clk]
set_input_transition -max 0.1  [get_ports mc_w_intf.rst_n]
set_input_transition -min 0.1  [get_ports mc_w_intf.rst_n]
set_input_transition -max 0.1  [get_ports mc_w_intf.wvalid]
set_input_transition -min 0.1  [get_ports mc_w_intf.wvalid]
set_input_transition -max 0.1  [get_ports mc_w_intf.wready]
set_input_transition -min 0.1  [get_ports mc_w_intf.wready]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wid[3]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wid[3]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wid[2]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wid[2]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wid[1]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wid[1]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wid[0]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wid[0]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[63]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[63]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[62]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[62]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[61]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[61]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[60]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[60]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[59]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[59]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[58]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[58]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[57]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[57]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[56]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[56]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[55]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[55]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[54]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[54]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[53]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[53]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[52]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[52]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[51]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[51]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[50]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[50]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[49]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[49]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[48]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[48]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[47]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[47]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[46]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[46]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[45]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[45]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[44]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[44]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[43]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[43]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[42]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[42]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[41]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[41]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[40]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[40]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[39]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[39]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[38]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[38]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[37]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[37]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[36]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[36]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[35]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[35]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[34]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[34]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[33]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[33]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[32]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[32]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[31]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[31]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[30]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[30]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[29]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[29]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[28]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[28]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[27]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[27]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[26]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[26]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[25]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[25]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[24]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[24]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[23]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[23]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[22]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[22]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[21]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[21]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[20]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[20]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[19]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[19]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[18]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[18]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[17]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[17]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[16]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[16]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[15]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[15]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[14]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[14]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[13]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[13]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[12]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[12]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[11]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[11]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[10]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[10]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[9]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[9]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[8]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[8]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[7]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[7]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[6]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[6]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[5]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[5]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[4]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[4]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[3]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[3]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[2]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[2]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[1]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[1]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wdata[0]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wdata[0]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wstrb[7]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wstrb[7]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wstrb[6]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wstrb[6]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wstrb[5]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wstrb[5]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wstrb[4]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wstrb[4]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wstrb[3]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wstrb[3]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wstrb[2]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wstrb[2]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wstrb[1]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wstrb[1]}]
set_input_transition -max 0.1  [get_ports {mc_w_intf.wstrb[0]}]
set_input_transition -min 0.1  [get_ports {mc_w_intf.wstrb[0]}]
set_input_transition -max 0.1  [get_ports mc_w_intf.wlast]
set_input_transition -min 0.1  [get_ports mc_w_intf.wlast]
set_input_transition -max 0.1  [get_ports mc_b_intf.clk]
set_input_transition -min 0.1  [get_ports mc_b_intf.clk]
set_input_transition -max 0.1  [get_ports mc_b_intf.rst_n]
set_input_transition -min 0.1  [get_ports mc_b_intf.rst_n]
set_input_transition -max 0.1  [get_ports mc_b_intf.bvalid]
set_input_transition -min 0.1  [get_ports mc_b_intf.bvalid]
set_input_transition -max 0.1  [get_ports mc_b_intf.bready]
set_input_transition -min 0.1  [get_ports mc_b_intf.bready]
set_input_transition -max 0.1  [get_ports {mc_b_intf.bid[3]}]
set_input_transition -min 0.1  [get_ports {mc_b_intf.bid[3]}]
set_input_transition -max 0.1  [get_ports {mc_b_intf.bid[2]}]
set_input_transition -min 0.1  [get_ports {mc_b_intf.bid[2]}]
set_input_transition -max 0.1  [get_ports {mc_b_intf.bid[1]}]
set_input_transition -min 0.1  [get_ports {mc_b_intf.bid[1]}]
set_input_transition -max 0.1  [get_ports {mc_b_intf.bid[0]}]
set_input_transition -min 0.1  [get_ports {mc_b_intf.bid[0]}]
set_input_transition -max 0.1  [get_ports {mc_b_intf.bresp[1]}]
set_input_transition -min 0.1  [get_ports {mc_b_intf.bresp[1]}]
set_input_transition -max 0.1  [get_ports {mc_b_intf.bresp[0]}]
set_input_transition -min 0.1  [get_ports {mc_b_intf.bresp[0]}]
set_input_transition -max 0.1  [get_ports mc_ar_intf.clk]
set_input_transition -min 0.1  [get_ports mc_ar_intf.clk]
set_input_transition -max 0.1  [get_ports mc_ar_intf.rst_n]
set_input_transition -min 0.1  [get_ports mc_ar_intf.rst_n]
set_input_transition -max 0.1  [get_ports mc_ar_intf.avalid]
set_input_transition -min 0.1  [get_ports mc_ar_intf.avalid]
set_input_transition -max 0.1  [get_ports mc_ar_intf.aready]
set_input_transition -min 0.1  [get_ports mc_ar_intf.aready]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aid[3]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aid[3]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aid[2]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aid[2]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aid[1]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aid[1]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aid[0]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aid[0]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[31]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[31]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[30]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[30]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[29]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[29]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[28]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[28]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[27]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[27]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[26]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[26]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[25]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[25]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[24]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[24]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[23]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[23]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[22]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[22]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[21]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[21]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[20]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[20]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[19]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[19]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[18]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[18]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[17]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[17]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[16]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[16]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[15]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[15]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[14]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[14]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[13]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[13]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[12]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[12]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[11]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[11]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[10]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[10]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[9]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[9]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[8]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[8]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[7]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[7]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[6]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[6]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[5]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[5]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[4]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[4]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[3]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[3]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[2]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[2]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[1]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[1]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aaddr[0]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aaddr[0]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.alen[3]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.alen[3]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.alen[2]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.alen[2]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.alen[1]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.alen[1]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.alen[0]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.alen[0]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.asize[2]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.asize[2]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.asize[1]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.asize[1]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.asize[0]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.asize[0]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aburst[1]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aburst[1]}]
set_input_transition -max 0.1  [get_ports {mc_ar_intf.aburst[0]}]
set_input_transition -min 0.1  [get_ports {mc_ar_intf.aburst[0]}]
set_input_transition -max 0.1  [get_ports mc_r_intf.clk]
set_input_transition -min 0.1  [get_ports mc_r_intf.clk]
set_input_transition -max 0.1  [get_ports mc_r_intf.rst_n]
set_input_transition -min 0.1  [get_ports mc_r_intf.rst_n]
set_input_transition -max 0.1  [get_ports mc_r_intf.rvalid]
set_input_transition -min 0.1  [get_ports mc_r_intf.rvalid]
set_input_transition -max 0.1  [get_ports mc_r_intf.rready]
set_input_transition -min 0.1  [get_ports mc_r_intf.rready]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rid[3]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rid[3]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rid[2]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rid[2]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rid[1]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rid[1]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rid[0]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rid[0]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[63]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[63]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[62]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[62]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[61]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[61]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[60]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[60]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[59]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[59]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[58]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[58]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[57]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[57]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[56]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[56]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[55]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[55]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[54]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[54]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[53]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[53]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[52]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[52]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[51]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[51]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[50]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[50]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[49]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[49]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[48]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[48]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[47]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[47]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[46]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[46]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[45]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[45]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[44]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[44]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[43]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[43]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[42]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[42]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[41]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[41]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[40]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[40]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[39]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[39]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[38]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[38]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[37]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[37]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[36]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[36]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[35]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[35]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[34]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[34]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[33]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[33]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[32]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[32]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[31]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[31]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[30]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[30]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[29]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[29]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[28]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[28]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[27]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[27]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[26]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[26]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[25]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[25]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[24]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[24]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[23]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[23]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[22]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[22]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[21]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[21]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[20]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[20]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[19]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[19]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[18]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[18]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[17]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[17]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[16]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[16]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[15]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[15]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[14]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[14]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[13]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[13]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[12]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[12]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[11]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[11]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[10]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[10]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[9]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[9]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[8]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[8]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[7]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[7]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[6]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[6]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[5]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[5]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[4]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[4]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[3]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[3]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[2]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[2]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[1]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[1]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rdata[0]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rdata[0]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rresp[1]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rresp[1]}]
set_input_transition -max 0.1  [get_ports {mc_r_intf.rresp[0]}]
set_input_transition -min 0.1  [get_ports {mc_r_intf.rresp[0]}]
set_input_transition -max 0.1  [get_ports mc_r_intf.rlast]
set_input_transition -min 0.1  [get_ports mc_r_intf.rlast]
